; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v5 - type_1 ?v3 - type_2)
 	      (pred_4 ?v7 - object ?v3 - type_2)
	      (pred_3 ?v5 - type_1 ?v8 - type_3)
	      (pred_1 ?v5 - type_1 ?v7 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v1 ?v4 - type_2)
       :precondition (and  (pred_2 ?v5 ?v1))
       :effect (and  (pred_2 ?v5 ?v4)
		     (not (pred_2 ?v5 ?v1))))

   (:action op_1
       :parameters (?v5 - type_1 ?v2 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v6) (pred_2 ?v5 ?v6) (pred_3 ?v5 ?v8))
       :effect (and (pred_1 ?v5 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v6)) 
		    (not (pred_3 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_1 ?v2 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v2 ?v8) (pred_2 ?v5 ?v6))
       :effect (and (pred_4 ?v2 ?v6)
		    (pred_3 ?v5 ?v8)
		    (not (pred_1 ?v5 ?v2 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_11 - type_1
obj_04 obj_10 obj_02 obj_07 - type_3
obj_01 obj_09 obj_08 - type_2
obj_03 obj_06 obj_12 - object)
(:init
(pred_2 obj_05 obj_09)
(pred_3 obj_05 obj_04)
(pred_3 obj_05 obj_10)
(pred_2 obj_11 obj_01)
(pred_3 obj_11 obj_02)
(pred_3 obj_11 obj_07)
(pred_4 obj_03 obj_01)
(pred_4 obj_06 obj_08)
(pred_4 obj_12 obj_01)
)
(:goal
(and
(pred_4 obj_03 obj_09)
(pred_4 obj_06 obj_08)
(pred_4 obj_12 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_09) (pred_2 obj_11 obj_09))))
  )
)
)

; plan
1. (op_1 obj_11 obj_03 obj_01 obj_07)
   deleted: (pred_4 obj_03 obj_01) (pred_3 obj_11 obj_07)
   added: (pred_1 obj_11 obj_03 obj_07)
   goals met: 2 of 3
2. (op_3 obj_05 obj_09 obj_01)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_01)
   goals met: 2 of 3
3. (op_3 obj_11 obj_01 obj_09)
   deleted: (pred_2 obj_11 obj_01)
   added: (pred_2 obj_11 obj_09)
   goals met: 2 of 3
4. (op_2 obj_11 obj_03 obj_09 obj_07)
   deleted: (pred_1 obj_11 obj_03 obj_07)
   added: (pred_4 obj_03 obj_09) (pred_3 obj_11 obj_07)
   goals met: 3 of 3
